getting-started-with-org-mode-thoughtbot.org
#+TITLE: getting started with org mode emacs
#+SETUPFILE: theme-readtheorg.setup
#+PROPERTY: :results output :exports both
* [[https://www.youtube.com/watch?v=SzA2YODtgK4][getting started with org mode emacs]]

* Outliner
Text text text!
** more items
** yet more items
** M-Ret to add a new entry
** M-[UP/Down] to arrange the 
Bold* itlaic/ verbatim=, strikethrough+

- bulleted
- list
- items


* insert links as mentioned [[file:getting-started-with-org-mode-thoughtbot.html][getting started with org mode exported html]]
** you can link links, =C-c l=
* Tables

put a pipe

|-----------+------|
| some data | data |
|-----------+------|
* exporting to other formats

=C-c C-e=

adding metadata to the org file

** #+TITLE: new title to the file

** no table of contents
#+begin_comment
,#+OPTIONS: toc:nil
#+end_comment

* including source codes
edit source block in a separate window using =C-c '=
#+begin_src ruby
  def fact(n)
    if n == 0
      1
    else
      n * fac(n-1)
    end
  end
#+end_src

