getting-started-with-org-mode-thoughtbot.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-07 Wed 22:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>getting started with org mode emacs</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">getting started with org mode emacs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga56d703">1. getting started with org mode emacs</a></li>
<li><a href="#org81c42a5">2. Outliner</a>
<ul>
<li><a href="#org294cd8a">2.1. more items</a></li>
<li><a href="#orge480af1">2.2. yet more items</a></li>
<li><a href="#orgdf0d021">2.3. M-Ret to add a new entry</a></li>
<li><a href="#orgf2298de">2.4. M-[UP/Down] to arrange the</a></li>
</ul>
</li>
<li><a href="#orgc55d72c">3. insert links as mentioned getting started with org mode exported html</a>
<ul>
<li><a href="#orga06477e">3.1. you can link links, <code>C-c l</code></a></li>
</ul>
</li>
<li><a href="#org3f921e5">4. Tables</a></li>
<li><a href="#org8b05275">5. exporting to other formats</a>
<ul>
<li><a href="#org41365b5">5.1. #+TITLE: new title to the file</a></li>
<li><a href="#orgcf97daa">5.2. no table of contents</a></li>
</ul>
</li>
<li><a href="#org2b2abd8">6. including source codes</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga56d703" class="outline-2">
<h2 id="orga56d703"><span class="section-number-2">1.</span> <a href="https://www.youtube.com/watch?v=SzA2YODtgK4">getting started with org mode emacs</a></h2>
</div>

<div id="outline-container-org81c42a5" class="outline-2">
<h2 id="org81c42a5"><span class="section-number-2">2.</span> Outliner</h2>
<div class="outline-text-2" id="text-2">
<p>
Text text text!
</p>
</div>
<div id="outline-container-org294cd8a" class="outline-3">
<h3 id="org294cd8a"><span class="section-number-3">2.1.</span> more items</h3>
</div>
<div id="outline-container-orge480af1" class="outline-3">
<h3 id="orge480af1"><span class="section-number-3">2.2.</span> yet more items</h3>
</div>
<div id="outline-container-orgdf0d021" class="outline-3">
<h3 id="orgdf0d021"><span class="section-number-3">2.3.</span> M-Ret to add a new entry</h3>
</div>
<div id="outline-container-orgf2298de" class="outline-3">
<h3 id="orgf2298de"><span class="section-number-3">2.4.</span> M-[UP/Down] to arrange the</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Bold* itlaic/ verbatim=, strikethrough+
</p>

<ul class="org-ul">
<li>bulleted</li>
<li>list</li>
<li>items</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc55d72c" class="outline-2">
<h2 id="orgc55d72c"><span class="section-number-2">3.</span> insert links as mentioned <a href="getting-started-with-org-mode-thoughtbot.html">getting started with org mode exported html</a></h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga06477e" class="outline-3">
<h3 id="orga06477e"><span class="section-number-3">3.1.</span> you can link links, <code>C-c l</code></h3>
</div>
</div>
<div id="outline-container-org3f921e5" class="outline-2">
<h2 id="org3f921e5"><span class="section-number-2">4.</span> Tables</h2>
<div class="outline-text-2" id="text-4">
<p>
put a pipe
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">some data</td>
<td class="org-left">data</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8b05275" class="outline-2">
<h2 id="org8b05275"><span class="section-number-2">5.</span> exporting to other formats</h2>
<div class="outline-text-2" id="text-5">
<p>
<code>C-c C-e</code>
</p>

<p>
adding metadata to the org file
</p>
</div>
<div id="outline-container-org41365b5" class="outline-3">
<h3 id="org41365b5"><span class="section-number-3">5.1.</span> #+TITLE: new title to the file</h3>
</div>

<div id="outline-container-orgcf97daa" class="outline-3">
<h3 id="orgcf97daa"><span class="section-number-3">5.2.</span> no table of contents</h3>
<div class="outline-text-3" id="text-5-2">
</div>
</div>
</div>
<div id="outline-container-org2b2abd8" class="outline-2">
<h2 id="org2b2abd8"><span class="section-number-2">6.</span> including source codes</h2>
<div class="outline-text-2" id="text-6">
<p>
edit source block in a separate window using <code>C-c '</code>
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #531ab6; font-weight: bold;">def</span> <span style="color: #721045;">fact</span>(n)
  <span style="color: #531ab6; font-weight: bold;">if</span> n == 0
    1
  <span style="color: #531ab6; font-weight: bold;">else</span>
    n * fac(n-1)
  <span style="color: #531ab6; font-weight: bold;">end</span>
<span style="color: #531ab6; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-08-07 Wed 22:34</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
